////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Модуль: "w:/shared/GCL/os/dir_op.h"
// генератор заголовочных файлов C++ (.h)
// Generated from UML model, root element: <<UtilityPack::Class>> shared::GCL::os::dir_op
//
// расширенные операции над каталогами (создание дерева, ...)
//
//
// Все права принадлежат ООО НПП "Гарант-Сервис".
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#ifndef __SHARED_GCL_OS_DIR_OP_H__
#define __SHARED_GCL_OS_DIR_OP_H__

#include "shared/Core/sys/std_inc.h"

namespace GCL {

// Создает дерево каталогов по заданному полному пути full_path. Путь можно задавать вместе с
// именем файла, тогда параметр is_path_with_filename  нужно установить в true.
// Возвращает true, если дерево каталогов успешно создано, или уже существует
bool create_tree_dirs (const char* full_path, bool is_path_with_filename);


} // namespace GCL


#endif //__SHARED_GCL_OS_DIR_OP_H__
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
