unit ev;

{ Библиотека "Эверест"    }
{ Начал: Люлин А.В.       }
{ Модуль: ev - }
{ Начат: 28.09.1999 10:18 }
{ $Id: ev.pas,v 1.1 2008/04/16 08:40:37 lulin Exp $ }

// $Log: ev.pas,v $
// Revision 1.1  2008/04/16 08:40:37  lulin
// - выделяем фасад для скрытия различий старого и нового редакторов.
//
// Revision 1.6  2005/05/30 14:48:01  lulin
// - объединил с веткой.
//
// Revision 1.5.6.1  2005/05/18 12:42:45  lulin
// - отвел новую ветку.
//
// Revision 1.4.4.1  2005/04/28 09:18:28  lulin
// - объединил с веткой B_Tag_Box.
//
// Revision 1.5  2005/04/12 09:58:31  lulin
// - вставлена более правильная директива - чтобы было удобнее искать.
//
// Revision 1.4  2004/11/02 12:47:30  lulin
// - поправлен заголовок об авторстве, т.к. оно у нас давно очень размыто.
//
// Revision 1.3  2000/12/15 15:10:33  law
// - вставлены директивы Log.
//

{$Include evDefine.inc }

interface

implementation

end.

