//..........................................................................................................................................................................................................................................................
unit ddPipeTypes;
{ –азличные типы дл€ труб }
{ Ќачата 15.05.2003 }

{ $Id: ddPipeTypes.pas,v 1.5 2013/05/21 12:12:02 fireton Exp $ }

// $Log: ddPipeTypes.pas,v $
// Revision 1.5  2013/05/21 12:12:02  fireton
// - const перед string-параметром
//
// Revision 1.4  2013/04/11 16:46:28  lulin
// - отлаживаем под XE3.
//
// Revision 1.3  2006/03/07 12:27:34  narry
// - изменение: нова€ технологи€ передачи заданий
//
// Revision 1.2  2005/02/16 17:10:41  narry
// - update: Delphi 2005
//
// Revision 1.1  2003/05/28 11:54:33  narry
// - “ипы данных и событий дл€ нового варианта импортно-экспортных труб
//

interface

type
 TddTopicEvent = procedure (aTopicNo: Longint; const aMessage: AnsiString) of object;

implementation

end.
