unit nev;

{ Библиотека "Эверест"    }
{ Начал: Люлин А.В.       }
{ Модуль: nev -           }
{ Начат: 31.03.2005 13:09 }
{ $Id: nev.pas,v 1.3 2007/12/04 12:47:51 lulin Exp $ }

// $Log: nev.pas,v $
// Revision 1.3  2007/12/04 12:47:51  lulin
// - перекладываем ветку в HEAD.
//
// Revision 1.2.6.1  2005/05/18 12:42:59  lulin
// - отвел новую ветку.
//
// Revision 1.1.2.1  2005/04/12 10:18:46  lulin
// - новые файлы переехали в новый каталог.
//
// Revision 1.1.2.1  2005/04/08 15:23:12  lulin
// - вставлена более правильная директива - чтобы проще было искать по контексту.
//
// Revision 1.1  2005/03/31 09:12:30  lulin
// - добавлено в CVS.
//

{$Include nevDefine.inc }

interface

implementation

end.

