unit evStdInt;

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Библиотека "Everest"
// Автор: Люлин А.В.
// Модуль: "w:/common/components/gui/Garant/Everest/evStdInt.pas"
// Начат: 03.12.1998 20:01
// Родные Delphi интерфейсы (.pas)
// Generated from UML model, root element: <<InterfaceFactoryPack::Class>> Shared Delphi::Everest::Standard::evStdInt
//
// Реализация "фабрик интерфейсов" для стандартных типов тегов библиотеки "Эверест".
//
//
// Все права принадлежат ООО НПП "Гарант-Сервис".
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// ! Полностью генерируется с модели. Править руками - нельзя. !

{$Include ..\Everest\evDefine.inc}

interface


implementation

end.