////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Модуль: I18NInitializer.cpp
// C++ implementation files (.cpp)
// Файл для инициализации объектов интернационализации.
// Используется только в проектах, для которых main функция
// или функция инициализации библиотеки не генерится с модели.
// При генерации с модели необходимо использовать соответствующую
// юзер-секцию для инициализации локали по-умолчанию
//
// Все права принадлежат ООО НПП "Гарант-Сервис".
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#ifndef __PILOT_I18NINITIALIZER_H__
#define __PILOT_I18NINITIALIZER_H__

#include "shared/GCI/I18N/I18N.h"

namespace I18NInitializer {

// инициализация механизма интернационализации сообщений. Передаваемый 
// параметр задаёт локаль языка ключей.
void init_messages (GCI::I18N::SupportedLocales locale);

}

#endif // __PILOT_I18NINITIALIZER_H__