unit NOT_FINISHED_k2Tags;

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Библиотека "K2"
// Автор: Люлин А.В.
// Модуль: "w:/common/components/rtl/Garant/K2/NOT_FINISHED_k2Tags.pas"
// Начат: 05.05.1998 09:54
// Родные Delphi интерфейсы (.pas)
// Generated from UML model, root element: <<Interfaces::Category>> Shared Delphi::K2::k2Tags
//
// Описание идентификаторов стандартных тегов и типов.
//
//
// Все права принадлежат ООО НПП "Гарант-Сервис".
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// ! Этот файл используется только для моделирования, а не для компиляции. !

{$Include ..\K2\k2Define.inc}

interface

const
  { вспомогательные тэги }
 k2_tiComplexBase = High(Byte) + 1;
  { база для указания сложной сортировки. }

type
 Tk2TagID = (
   
 );//Tk2TagID

 Tk2FontParam = k2_tiName..k2_tiIndex;

implementation

end.