////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Модуль: "w:/shared/Core/sys/AutoInit.h"
// генератор заголовочных файлов C++ (.h)
// Generated from UML model, root element: <<SimpleClass::Class>> shared::Core::sys::start_stop::AutoInit
//
// Класс для автоматической инициализации приложения и автоматической чистки ресурсов перед
// остановом.
//
//
// Все права принадлежат ООО НПП "Гарант-Сервис".
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#ifndef __SHARED_CORE_SYS_START_STOP_AUTOINIT_H__
#define __SHARED_CORE_SYS_START_STOP_AUTOINIT_H__

#include "ace/ACE.h"

namespace Core {

// Класс для автоматической инициализации приложения и автоматической чистки ресурсов перед
// остановом.
class AutoInit {
//////////////////////////////////////////////////////////////////////////////////////////
// constructors and destructor
public:
	// выполняет инициализацию (Core::init)
	AutoInit ();

public:
	~AutoInit ();

}; // class AutoInit

} // namespace Core


#endif //__SHARED_CORE_SYS_START_STOP_AUTOINIT_H__
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

